In [3]:
import pandas as pd
import mysql.connector

In [4]:
mydb = mysql.connector.connect(
    host= 'localhost',
    user= 'root',
    passwd= 'Akupebisnisno01',
    database='sakila')

In [5]:
mycursor= mydb.cursor()
mycursor.execute('''
show full tables;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

# Pertanyaan 1

Dari berapa banyak district pelanggan kita berasal? Output yang diharapkan:

# Pertanyaan 2

Tampilkan 5 film yang paling sering dipinjam! Output yang diharapkan:

In [10]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from film limit 3;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
pd.DataFrame(myresult, columns=columns)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42

In [18]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from customer limit 3;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
pd.DataFrame(myresult, columns=columns)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [21]:
mycursor= mydb.cursor()
mycursor.execute('''
select * from inventory limit 3;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
pd.DataFrame(myresult, columns=columns)

   inventory_id  film_id  store_id         last_update
0             1        1         1 2006-02-15 05:09:17
1             2        1         1 2006-02-15 05:09:17
2             3        1         1 2006-02-15 05:09:17

In [33]:
mycursor= mydb.cursor()
mycursor.execute('''
select title, count(title) as jumlah_dipinjam
from film
group by title
order by jumlah_dipinjam desc
limit 3;
''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
pd.DataFrame(myresult, columns=columns)

              title  jumlah_dipinjam
0  ACADEMY DINOSAUR                1
1    ACE GOLDFINGER                1
2  ADAPTATION HOLES                1

# Pertanyaan 3

Tampilkan ** nama 5 pelanggan** yang paling sering meminjam film! Output yang diharapkan:

# Pertanyaan 4

Dari hasil di atas kita tahu bahwa Eleanor Hunt adalah pelanggan yang paling sering meminjam film. Tampilkan genre film apa saja yang dipinjam oleh Eleanor Hunt! Urutkan dari jumlah terbesar. Output yang diharapkan:

In [9]:
mycursor= mydb.cursor()
mycursor.execute('''

''')
myresult= mycursor.fetchall()
# myresult
columns= mycursor.column_names
pd.DataFrame(myresult, columns=columns)

ProgrammingError: 1065 (42000): Query was empty